//Задача 13: Напишите программу, которая выводит 
//третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите число: ");
int i = int.Parse(Console.ReadLine());
int b = i;
if (b / 100 <= 0)
{
    Console.WriteLine($"{i} -> третьей цифры нет");
    return;
}
while (b / 1000 > 0){
    b = b / 10;
}
int a = b % 10;

Console.WriteLine($"{i} -> {a}");