// Задача 10: Напишите программу, которая принимает на 
//вход трёхзначное число и на выходе показывает вторую цифру этого числа.
//456 -> 5
//782 -> 8 
//918 -> 1

Console.Write("Введите трёхзначное число: ");
int n = int.Parse(Console.ReadLine());
int a = n % 100;
int result = a / 10;
Console.WriteLine($"{n} -> {result}");


